Revit 2026 API

# ConduitSizes Properties

---

The ConduitSizes type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Count | Count of the items contained in the collection. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

ConduitSizes Class

Autodesk.Revit.DB.Electrical Namespace